*** src/psp/format_2025/backends.rs:137:24: replace > with >= in <impl Backend for MMapBackend>::read_at

*** mutation diff:
--- src/psp/format_2025/backends.rs
+++ replace > with >= in <impl Backend for MMapBackend>::read_at
@@ -129,17 +129,17 @@
         self.mmap = None;
         self.file = None;
         self.path = None;
         Ok(())
     }
 
     fn read_at(&mut self, offset: u64, size: usize) -> Result<Vec<u8>> {
         trace!("🔍 Safe file read_at: offset={}, size={}", offset, size);
-        if size as u64 > MAX_SLOT_SIZE {
+        if size as u64 >= /* ~ changed by cargo-mutants ~ */ MAX_SLOT_SIZE {
             return Err(FlavorError::Generic(format!(
                 "Read size {} exceeds maximum allowed ({} bytes)",
                 size, MAX_SLOT_SIZE
             )));
         }
         if let Some(file) = &mut self.file {
             let timer = Instant::now();
             file.seek(SeekFrom::Start(offset))

*** result: Success
