*** src/psp/format_2025/backends.rs:17:44: replace * with /

*** mutation diff:
--- src/psp/format_2025/backends.rs
+++ replace * with /
@@ -9,17 +9,17 @@
 use std::path::Path;
 use std::time::Instant;
 
 use super::defaults::{ACCESS_AUTO, ACCESS_FILE, ACCESS_MMAP, ACCESS_STREAM, DEFAULT_CHUNK_SIZE};
 use super::slots::SlotDescriptor;
 use crate::exceptions::{FlavorError, Result};
 
 /// Maximum allocation size for a single read (4 GB)
-const MAX_SLOT_SIZE: u64 = 4 * 1024 * 1024 * 1024;
+const MAX_SLOT_SIZE: u64 = 4 * 1024 * 1024 / /* ~ changed by cargo-mutants ~ */ 1024;
 
 /// Trait for PSPF bundle access backends
 pub trait Backend: Send + Sync {
     /// Open the bundle file
     fn open(&mut self, path: &Path) -> Result<()>;
 
     /// Close the bundle file
     fn close(&mut self) -> Result<()>;

---- psp::format_2025::verifier::tests::test_verify_attestation_policy_hash_zero_field_skip stdout ----

thread 'psp::format_2025::verifier::tests::test_verify_attestation_policy_hash_zero_field_skip' (14436876) panicked at src/psp/format_2025/verifier.rs:666:53:
expected nil for zero policy hash: Generic("Read size 8200 exceeds maximum allowed (4096 bytes)")

---- psp::format_2025::verifier::tests::test_attestation_sbom_digest_present_no_slot stdout ----

thread 'psp::format_2025::verifier::tests::test_attestation_sbom_digest_present_no_slot' (14436872) panicked at src/psp/format_2025/verifier.rs:581:9:
error should mention attestation: Read size 8200 exceeds maximum allowed (4096 bytes)

---- psp::format_2025::verifier::tests::test_verify_attestation_policy_hash_present_no_policy_fails stdout ----

thread 'psp::format_2025::verifier::tests::test_verify_attestation_policy_hash_present_no_policy_fails' (14436875) panicked at src/psp/format_2025/verifier.rs:706:9:
error should mention policy: Read size 8200 exceeds maximum allowed (4096 bytes)

failures:
    psp::format_2025::verifier::tests::test_attestation_sbom_digest_absent_skipped
    psp::format_2025::verifier::tests::test_attestation_sbom_digest_match
    psp::format_2025::verifier::tests::test_attestation_sbom_digest_mismatch
    psp::format_2025::verifier::tests::test_attestation_sbom_digest_present_no_slot
    psp::format_2025::verifier::tests::test_verify_attestation_policy_hash_match
    psp::format_2025::verifier::tests::test_verify_attestation_policy_hash_mismatch
    psp::format_2025::verifier::tests::test_verify_attestation_policy_hash_present_no_policy_fails
    psp::format_2025::verifier::tests::test_verify_attestation_policy_hash_zero_field_skip

test result: FAILED. 101 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
