*** src/psp/format_2025/backends.rs:219:9: replace <impl Backend for FileBackend>::close -> Result<()> with Ok(())

*** mutation diff:
--- src/psp/format_2025/backends.rs
+++ replace <impl Backend for FileBackend>::close -> Result<()> with Ok(())
@@ -211,20 +211,17 @@
         self.file = Some(file);
         self.path = Some(path.to_path_buf());
         self.cache.clear();
 
         Ok(())
     }
 
     fn close(&mut self) -> Result<()> {
-        self.file = None;
-        self.path = None;
-        self.cache.clear();
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     fn read_at(&mut self, offset: u64, size: usize) -> Result<Vec<u8>> {
         trace!("🗓️ File read_at: offset={}, size={}", offset, size);
         if size as u64 > MAX_SLOT_SIZE {
             return Err(FlavorError::Generic(format!(
                 "Read size {} exceeds maximum allowed ({} bytes)",
                 size, MAX_SLOT_SIZE

*** result: Success
