*** src/psp/format_2025/backends.rs:251:21: replace <= with > in <impl Backend for FileBackend>::read_at

*** mutation diff:
--- src/psp/format_2025/backends.rs
+++ replace <= with > in <impl Backend for FileBackend>::read_at
@@ -243,17 +243,17 @@
             file.seek(SeekFrom::Start(offset))
                 .map_err(FlavorError::IoError)?;
 
             let mut buffer = vec![0u8; size];
             file.read_exact(&mut buffer).map_err(FlavorError::IoError)?;
             trace!("✅ File read {} bytes in {:?}", size, timer.elapsed());
 
             // Cache small reads
-            if size <= 4096 {
+            if size > /* ~ changed by cargo-mutants ~ */ 4096 {
                 self.cache.insert(cache_key, buffer.clone());
 
                 // Limit cache size
                 if self.cache.len() > 100 {
                     // Remove oldest entries (simple FIFO)
                     let keys: Vec<_> = self.cache.keys().take(20).cloned().collect();
                     for key in keys {
                         self.cache.remove(&key);

*** result: Success
