*** src/psp/format_2025/backends.rs:311:26: replace == with != in StreamBackend::stream_slot

*** mutation diff:
--- src/psp/format_2025/backends.rs
+++ replace == with != in StreamBackend::stream_slot
@@ -303,17 +303,17 @@
         &'a mut self,
         descriptor: &SlotDescriptor,
     ) -> impl Iterator<Item = Result<Vec<u8>>> + 'a {
         let mut offset = descriptor.offset;
         let mut remaining = descriptor.size;
         let chunk_size = self.chunk_size;
 
         std::iter::from_fn(move || {
-            if remaining == 0 {
+            if remaining != /* ~ changed by cargo-mutants ~ */ 0 {
                 return None;
             }
 
             let to_read = std::cmp::min(chunk_size as u64, remaining) as usize;
             let result = self.read_at(offset, to_read);
 
             if result.is_ok() {
                 offset += to_read as u64;

*** result: Success
