*** src/psp/format_2025/backends.rs:319:24: replace += with -= in StreamBackend::stream_slot

*** mutation diff:
--- src/psp/format_2025/backends.rs
+++ replace += with -= in StreamBackend::stream_slot
@@ -311,17 +311,17 @@
             if remaining == 0 {
                 return None;
             }
 
             let to_read = std::cmp::min(chunk_size as u64, remaining) as usize;
             let result = self.read_at(offset, to_read);
 
             if result.is_ok() {
-                offset += to_read as u64;
+                offset -= /* ~ changed by cargo-mutants ~ */ to_read as u64;
                 remaining -= to_read as u64;
             }
 
             Some(result)
         })
     }
 }

*** result: Success
