*** src/psp/format_2025/backends.rs:33:22: replace > with < in Backend::read_slot

*** mutation diff:
--- src/psp/format_2025/backends.rs
+++ replace > with < in Backend::read_slot
@@ -25,17 +25,17 @@
     fn close(&mut self) -> Result<()>;
 
     /// Read data at specific offset
     fn read_at(&mut self, offset: u64, size: usize) -> Result<Vec<u8>>;
 
     /// Read slot data based on descriptor
     fn read_slot(&mut self, descriptor: &SlotDescriptor) -> Result<Vec<u8>> {
         let slot_size = descriptor.size;
-        if slot_size > MAX_SLOT_SIZE {
+        if slot_size < /* ~ changed by cargo-mutants ~ */ MAX_SLOT_SIZE {
             return Err(FlavorError::Generic(format!(
                 "Slot size {} exceeds maximum allowed size ({} bytes)",
                 slot_size, MAX_SLOT_SIZE
             )));
         }
         let slot_offset = descriptor.offset;
         self.read_at(slot_offset, slot_size as usize)
     }

---- psp::format_2025::verifier::tests::test_attestation_sbom_digest_match stdout ----

thread 'psp::format_2025::verifier::tests::test_attestation_sbom_digest_match' (14449970) panicked at src/psp/format_2025/verifier.rs:483:53:
should pass for matching digest: Generic("Slot size 20 exceeds maximum allowed size (4294967296 bytes)")

---- psp::format_2025::verifier::tests::test_attestation_sbom_digest_mismatch stdout ----

thread 'psp::format_2025::verifier::tests::test_attestation_sbom_digest_mismatch' (14449971) panicked at src/psp/format_2025/verifier.rs:493:9:
error should mention mismatch: Slot size 21 exceeds maximum allowed size (4294967296 bytes)

failures:
    psp::format_2025::verifier::tests::test_attestation_sbom_digest_match
    psp::format_2025::verifier::tests::test_attestation_sbom_digest_mismatch

test result: FAILED. 107 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
