*** src/psp/format_2025/backends.rs:456:9: replace <impl Backend for HybridBackend>::view_at -> Result<&[u8]> with Ok(Vec::leak(vec![0]))

*** mutation diff:
--- src/psp/format_2025/backends.rs
+++ replace <impl Backend for HybridBackend>::view_at -> Result<&[u8]> with Ok(Vec::leak(vec![0]))
@@ -448,19 +448,17 @@
             Ok(buffer)
         } else {
             Err(FlavorError::Generic("Backend not opened".into()))
         }
     }
 
     fn view_at(&self, _offset: u64, _size: usize) -> Result<&[u8]> {
         // Zero-copy view not available without memory mapping
-        Err(FlavorError::Generic(
-            "View not available in safe file backend".into(),
-        ))
+        Ok(Vec::leak(vec![0])) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Factory function to create the appropriate backend
 pub fn create_backend(mode: u8, path: Option<&Path>) -> Box<dyn Backend> {
     let mut mode = mode;
 
     if mode == ACCESS_AUTO {

*** result: Success
